piconomix/px-fwlib/libs/ATmega_DFP/atdf/ATmega328PB.atdf
<?xml version='1.0' encoding='UTF-8'?>
<avr-tools-device-file xmlns:xalan="http://xml.apache.org/xalan" xmlns:NumHelper="NumHelper" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATmega328PB-AU" tempmin="-40" tempmax="85" speedmax="20000000" pinout="TQFP32" package="TQFP32" vccmin="1.8" vccmax="5.5"/>
    <variant ordercode="ATmega328PB-MU" tempmin="-40" tempmax="85" speedmax="20000000" pinout="VQFN32" package="VQFN32" vccmin="1.8" vccmax="5.5"/>
    <variant ordercode="ATmega328PB-AN" tempmin="-40" tempmax="105" speedmax="20000000" pinout="TQFP32" package="TQFP32" vccmin="1.8" vccmax="5.5"/>
    <variant ordercode="ATmega328PB-MN" tempmin="-40" tempmax="105" speedmax="20000000" pinout="VQFN32" package="VQFN32" vccmin="1.8" vccmax="5.5"/>
  </variants>
  <devices>
    <device name="ATmega328PB" architecture="AVR8" family="megaAVR">
      <address-spaces>
        <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x8000">
          <memory-segment start="0x0000" size="0x8000" type="flash" rw="RW" exec="1" name="FLASH" pagesize="0x80"/>
          <memory-segment start="0x7e00" size="0x0200" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1" pagesize="0x80"/>
          <memory-segment start="0x7c00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2" pagesize="0x80"/>
          <memory-segment start="0x7800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3" pagesize="0x80"/>
          <memory-segment start="0x7000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4" pagesize="0x80"/>
        </address-space>
        <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
          <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
        </address-space>
        <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
          <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
        </address-space>
        <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
          <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
        </address-space>
        <address-space endianness="little" name="data" id="data" start="0x0000" size="0x0900">
          <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
          <memory-segment name="MAPPED_IO" start="0x0020" size="0x00e0" type="io" external="false"/>
          <memory-segment name="IRAM" start="0x0100" size="0x0800" type="ram" external="false"/>
        </address-space>
        <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0400">
          <memory-segment start="0x0000" size="0x0400" type="eeprom" rw="RW" exec="0" name="EEPROM" pagesize="0x04"/>
        </address-space>
        <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
        <address-space endianness="little" name="osccal" id="osccal" start="0" size="1">
          <memory-segment start="0" size="1" type="osccal" rw="R" exec="0" name="OSCCAL"/>
        </address-space>
      </address-spaces>
      <peripherals>
        <module name="USART">
          <instance name="USART0">
            <register-group name="USART0" name-in-module="USART0" offset="0x00" address-space="data"/>
            <signals>
              <signal group="TXD" function="default" pad="PD1"/>
              <signal group="RXD" function="default" pad="PD0"/>
              <signal group="XCK" function="default" pad="PD4"/>
            </signals>
          </instance>
          <instance name="USART1">
            <register-group name="USART1" name-in-module="USART1" offset="0x00" address-space="data"/>
            <signals>
              <signal group="TXD" function="default" pad="PB3"/>
              <signal group="RXD" function="default" pad="PB4"/>
              <signal group="XCK" function="default" pad="PB5"/>
            </signals>
          </instance>
        </module>
        <module name="TWI">
          <instance name="TWI0">
            <register-group name="TWI0" name-in-module="TWI0" offset="0x00" address-space="data"/>
            <signals>
              <signal group="SDA" function="default" pad="PC4"/>
              <signal group="SCL" function="default" pad="PC5"/>
            </signals>
          </instance>
          <instance name="TWI1">
            <register-group name="TWI1" name-in-module="TWI1" offset="0x00" address-space="data"/>
            <signals>
              <signal group="SDA" function="default" pad="PE0"/>
              <signal group="SCL" function="default" pad="PE1"/>
            </signals>
          </instance>
        </module>
        <module name="TC16">
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data"/>
            <signals>
              <signal group="T" function="default" pad="PD5"/>
              <signal group="ICP" function="default" pad="PB0"/>
              <signal group="OCA" function="default" pad="PB1"/>
              <signal group="OCB" function="default" pad="PB2"/>
            </signals>
          </instance>
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC3" offset="0x00" address-space="data"/>
            <signals>
              <signal group="T" function="default" pad="PE3"/>
              <signal group="ICP" function="default" pad="PE2"/>
              <signal group="OCA" function="default" pad="PD0"/>
              <signal group="OCB" function="default" pad="PD2"/>
            </signals>
          </instance>
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC4" offset="0x00" address-space="data"/>
            <signals>
              <signal group="T" function="default" pad="PE1"/>
              <signal group="ICP" function="default" pad="PE0"/>
              <signal group="OCA" function="default" pad="PD1"/>
              <signal group="OCB" function="default" pad="PD2"/>
            </signals>
          </instance>
        </module>
