piconomix/px-fwlib/libs/ATmega_DFP/atdf/ATmega328PB.atdf
        <module name="TC8_ASYNC">
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC2" offset="0x00" address-space="data"/>
            <signals>
              <signal group="OCA" function="default" pad="PB3"/>
              <signal group="OCB" function="default" pad="PD3"/>
            </signals>
          </instance>
        </module>
        <module name="ADC">
          <instance name="ADC">
            <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data"/>
            <signals>
              <signal group="ADC" index="0" function="default" pad="PC0"/>
              <signal group="ADC" index="1" function="default" pad="PC1"/>
              <signal group="ADC" index="2" function="default" pad="PC2"/>
              <signal group="ADC" index="3" function="default" pad="PC3"/>
              <signal group="ADC" index="4" function="default" pad="PC4"/>
              <signal group="ADC" index="5" function="default" pad="PC5"/>
              <signal group="ADC" index="6" function="default" pad="PE2"/>
              <signal group="ADC" index="7" function="default" pad="PE3"/>
            </signals>
          </instance>
        </module>
        <module name="AC">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data"/>
            <signals>
              <signal group="AC" function="default" pad="PE0"/>
              <signal group="AIN" index="0" function="default" pad="PD6"/>
              <signal group="AIN" index="1" function="default" pad="PD7"/>
            </signals>
          </instance>
        </module>
        <module name="PORT">
          <instance name="PORTB" caption="I/O Port">
            <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data" caption="I/O Port"/>
            <signals>
              <signal group="P" function="default" pad="PB0" index="0"/>
              <signal group="P" function="default" pad="PB1" index="1"/>
              <signal group="P" function="default" pad="PB2" index="2"/>
              <signal group="P" function="default" pad="PB3" index="3"/>
              <signal group="P" function="default" pad="PB4" index="4"/>
              <signal group="P" function="default" pad="PB5" index="5"/>
              <signal group="P" function="default" pad="PB6" index="6"/>
              <signal group="P" function="default" pad="PB7" index="7"/>
            </signals>
          </instance>
          <instance name="PORTC" caption="I/O Port">
            <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data" caption="I/O Port"/>
            <signals>
              <signal group="P" function="default" pad="PC0" index="0"/>
              <signal group="P" function="default" pad="PC1" index="1"/>
              <signal group="P" function="default" pad="PC2" index="2"/>
              <signal group="P" function="default" pad="PC3" index="3"/>
              <signal group="P" function="default" pad="PC4" index="4"/>
              <signal group="P" function="default" pad="PC5" index="5"/>
              <signal group="P" function="default" pad="PC6" index="6"/>
            </signals>
          </instance>
          <instance name="PORTD" caption="I/O Port">
            <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data" caption="I/O Port"/>
            <signals>
              <signal group="P" function="default" pad="PD0" index="0"/>
              <signal group="P" function="default" pad="PD1" index="1"/>
              <signal group="P" function="default" pad="PD2" index="2"/>
              <signal group="P" function="default" pad="PD3" index="3"/>
              <signal group="P" function="default" pad="PD4" index="4"/>
              <signal group="P" function="default" pad="PD5" index="5"/>
              <signal group="P" function="default" pad="PD6" index="6"/>
              <signal group="P" function="default" pad="PD7" index="7"/>
            </signals>
          </instance>
          <instance name="PORTE" caption="I/O Port">
            <register-group name="PORTE" name-in-module="PORTE" offset="0x00" address-space="data" caption="I/O Port"/>
            <signals>
              <signal group="P" function="default" pad="PE0" index="0"/>
              <signal group="P" function="default" pad="PE1" index="1"/>
              <signal group="P" function="default" pad="PE2" index="2"/>
              <signal group="P" function="default" pad="PE3" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="TC8">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"/>
            <signals>
              <signal group="T" function="default" pad="PD4"/>
              <signal group="OCB" function="default" pad="PD5"/>
              <signal group="OCA" function="default" pad="PD6"/>
            </signals>
          </instance>
        </module>
        <module name="EXINT">
          <instance name="EXINT">
            <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data"/>
            <signals>
              <signal group="INT" index="1" function="default" pad="PD3"/>
              <signal group="PCINT" index="19" function="default" pad="PD3"/>
              <signal group="PCINT" index="20" function="default" pad="PD4"/>
              <signal group="PCINT" index="24" function="default" pad="PE0"/>
              <signal group="PCINT" index="25" function="default" pad="PE1"/>
              <signal group="PCINT" index="6" function="default" pad="PB6"/>
              <signal group="PCINT" index="7" function="default" pad="PB7"/>
              <signal group="PCINT" index="21" function="default" pad="PD5"/>
              <signal group="PCINT" index="22" function="default" pad="PD6"/>
              <signal group="PCINT" index="23" function="default" pad="PD7"/>
              <signal group="PCINT" index="0" function="default" pad="PB0"/>
              <signal group="PCINT" index="1" function="default" pad="PB1"/>
              <signal group="PCINT" index="2" function="default" pad="PB2"/>
              <signal group="PCINT" index="3" function="default" pad="PB3"/>
              <signal group="PCINT" index="4" function="default" pad="PB4"/>
              <signal group="PCINT" index="5" function="default" pad="PB5"/>
              <signal group="PCINT" index="27" function="default" pad="PE2"/>
              <signal group="PCINT" index="8" function="default" pad="PC0"/>
              <signal group="PCINT" index="9" function="default" pad="PC1"/>
              <signal group="PCINT" index="10" function="default" pad="PC2"/>
              <signal group="PCINT" index="11" function="default" pad="PC3"/>
              <signal group="PCINT" index="12" function="default" pad="PC4"/>
              <signal group="PCINT" index="13" function="default" pad="PC5"/>
              <signal group="PCINT" index="14" function="default" pad="PC6"/>
              <signal group="PCINT" index="16" function="default" pad="PD0"/>
              <signal group="PCINT" index="17" function="default" pad="PD1"/>
              <signal group="PCINT" index="18" function="default" pad="PD2"/>
              <signal group="INT" index="0" function="default" pad="PD2"/>
            </signals>
          </instance>
        </module>
        <module name="SPI">
          <instance name="SPI0">
            <register-group name="SPI0" name-in-module="SPI0" offset="0x00" address-space="data"/>
            <signals>
              <signal group="SS" function="default" pad="PB2"/>
              <signal group="MOSI" function="default" pad="PB3"/>
              <signal group="MISO" function="default" pad="PB4"/>
              <signal group="SCK" function="default" pad="PB5"/>
            </signals>
          </instance>
          <instance name="SPI1">
            <register-group name="SPI1" name-in-module="SPI1" offset="0x00" address-space="data"/>
            <signals>
              <signal group="SS" function="default" pad="PE2"/>
              <signal group="SCK" function="default" pad="PC1"/>
              <signal group="MISO" function="default" pad="PC0"/>
              <signal group="MOSI" function="default" pad="PE3"/>
            </signals>
          </instance>
        </module>
        <module name="WDT">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data"/>
