piconomix/px-fwlib/libs/ATmega_DFP/atdf/ATmega328PB.atdf
      <value-group name="COMM_SCK_RATE_3BIT">
        <value caption="fosc/2 or fosc/4" name="FOSC_2_OR_FOSC_4" value="0x00"/>
        <value caption="fosc/8 or fosc/16" name="FOSC_8_OR_FOSC_16" value="0x01"/>
        <value caption="fosc/32 or fosc/64" name="FOSC_32_OR_FOSC_64" value="0x02"/>
        <value caption="fosc/64 or fosc/128" name="FOSC_64_OR_FOSC_128" value="0x03"/>
      </value-group>
    </module>
    <module name="WDT">
      <register-group name="WDT">
        <register caption="Watchdog Timer Control Register" name="WDTCSR" offset="0x60" size="1" ocd-rw="R">
          <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDIF"/>
          <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDIE"/>
          <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP" values="WDOG_TIMER_PRESCALE_4BITS"/>
          <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
        </register>
      </register-group>
      <value-group name="WDOG_TIMER_PRESCALE_4BITS">
        <value caption="Oscillator Cycles 2K" name="OSCILLATOR_CYCLES_2K" value="0x00"/>
        <value caption="Oscillator Cycles 4K" name="OSCILLATOR_CYCLES_4K" value="0x01"/>
        <value caption="Oscillator Cycles 8K" name="OSCILLATOR_CYCLES_8K" value="0x02"/>
        <value caption="Oscillator Cycles 16K" name="OSCILLATOR_CYCLES_16K" value="0x03"/>
        <value caption="Oscillator Cycles 32K" name="OSCILLATOR_CYCLES_32K" value="0x04"/>
        <value caption="Oscillator Cycles 64K" name="OSCILLATOR_CYCLES_64K" value="0x05"/>
        <value caption="Oscillator Cycles 128K" name="OSCILLATOR_CYCLES_128K" value="0x06"/>
        <value caption="Oscillator Cycles 256K" name="OSCILLATOR_CYCLES_256K" value="0x07"/>
        <value caption="Oscillator Cycles 512K" name="OSCILLATOR_CYCLES_512K" value="0x08"/>
        <value caption="Oscillator Cycles 1024K" name="OSCILLATOR_CYCLES_1024K" value="0x09"/>
      </value-group>
    </module>
    <module name="CFD">
      <register-group name="CFD">
        <register caption="XOSC Failure Detection Control and Status Register" name="XFDCSR" offset="0x62" size="1">
          <bitfield caption="Failure Detection Interrupt Flag" mask="0x02" name="XFDIF"/>
          <bitfield caption="Failure Detection Interrupt Enable" mask="0x01" name="XFDIE"/>
        </register>
      </register-group>
    </module>
    <module name="PTC"/>
    <module name="CPU">
      <register-group name="CPU">
        <register caption="Power Reduction Register 0" name="PRR0" offset="0x64" size="1" ocd-rw="R">
          <bitfield caption="Power Reduction TWI0" mask="0x80" name="PRTWI0"/>
          <bitfield caption="Power Reduction Timer/Counter2" mask="0x40" name="PRTIM2"/>
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x20" name="PRTIM0"/>
          <bitfield caption="Power Reduction USART1" mask="0x10" name="PRUSART1"/>
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
          <bitfield caption="Power Reduction Serial Peripheral Interface 1" mask="0x04" name="PRSPI0"/>
          <bitfield caption="Power Reduction USART0" mask="0x02" name="PRUSART0"/>
          <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
        </register>
        <register caption="Power Reduction Register 1" name="PRR1" offset="0x65" size="1" ocd-rw="R">
          <bitfield caption="Power Reduction TWI1" mask="0x20" name="PRTWI1"/>
          <bitfield caption="Power Reduction Peripheral Touch Controller" mask="0x10" name="PRPTC"/>
          <bitfield caption="Power Reduction Timer/Counter4" mask="0x08" name="PRTIM4"/>
          <bitfield caption="Power Reduction Serial Peripheral Interface 1" mask="0x04" name="PRSPI1"/>
          <bitfield caption="Power Reduction Timer/Counter3" mask="0x01" name="PRTIM3"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x66" size="1" mask="0xFF" ocd-rw="R">
          <bitfield caption="Oscillator Calibration" mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="Clock Prescale Register" name="CLKPR" offset="0x61" size="1" ocd-rw="R">
          <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
          <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
        </register>
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Stack Pointer" name="SP" offset="0x5D" size="2" mask="0x0FFF"/>
        <register caption="Store Program Memory Control and Status Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read-While-Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
          <bitfield caption="Read-While-Write section read enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory" mask="0x01" name="SPMEN"/>
        </register>
